{"modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of2", "group1-shard2of2"], "weights": [{"dtype": "float32", "shape": [20, 2048], "name": "lstm_1/kernel"}, {"dtype": "float32", "shape": [512, 2048], "name": "lstm_1/recurrent_kernel"}, {"dtype": "float32", "shape": [2048], "name": "lstm_1/bias"}]}, {"paths": ["group2-shard1of1"], "weights": [{"dtype": "float32", "shape": [512, 100], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [100], "name": "dense_1/bias"}]}, {"paths": ["group3-shard1of1"], "weights": [{"dtype": "float32", "shape": [100, 100], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [100], "name": "dense_2/bias"}]}]}